# Slope Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Slope Property
SpecTypeId Class See Also
---
Slope, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Slope { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Slope As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Slope {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace